Autodesk.Revit.Utility.AssetPropertyList.GetValue
Gets collection of properties stored in this property list.
Remarks:
All the properties in the list are of the same AssetPropertyType.
The AssetPropertyType can only be APT_Integer, APT_DoubleArray4d, APT_Float or APT_Double.
Since:
2014

Autodesk.Revit.Utility.AssetPropertyList
Represents a list of AssetProperty(s).
Since:
2014